job_code = {
    # "외식·음료"
    "1000": {
        '1121' : '서빙',
        '1122' : '주방장·조리사',
        '1123' : '주방보조·설거지',
        '1124' : '바리스타',
        '1125' : '제과제빵사',
        '1010' : '일반음식점',
        '1020' : '레스토랑',
        '1030' : '패밀리레스토랑',
        '1040' : '패스트푸드점',
        '1050' : '치킨·피자전문점',
        '1060' : '커피전문점',
        '1070' : '아이스크림·디저트',
        '1080' : '베이커리·도넛·떡',
        '1090' : '호프·일반주점',
        '1100' : '바(bar)',
        '1110' : '급식·푸드시스템',
        '1120' : '도시락·반찬'
    },
    # "매장관리·판매"
    "2000": {
        '2121' : '매장관리·판매',
        '2122' : '캐셔·카운터',
        '2123' : '판촉도우미',
        '2124' : 'MD·쇼핑몰운영',
        '2010' : '백화점·쇼핑몰',
        '2020' : '유통점·마트',
        '2137' : '도소매·전통시장',
        '2030' : '편의점',
        '2050' : '의류·잡화·쥬얼리매장',
        '2060' : '뷰티·헬스스토어',
        '2070' : '휴대폰·전자기기매장',
        '2080' : '가구·침구·인테리어',
        '2138' : '생활용품샵',
        '2090' : '서점·문구·팬시',
        '2100' : '약국',
        '2110' : '농수산·청과·축산',
        '2120' : '화훼·꽃집',
        '2125' : '스터디룸·독서실·고시원',
        '2126' : 'PC방',
        '2127' : '노래방',
        '2128' : '볼링·당구장',
        '2129' : '스크린 골프·야구',
        '2130' : 'DVD·멀티방·만화카페',
        '2131' : '오락실·게임장',
        '2132' : '이색테마카페',
        '2133' : '키즈카페',
        '2134' : '찜질방·사우나·스파',
        '2135' : '피트니스·스포츠',
        '2136' : '고속도로휴게소',
        '2990' : '매장관리·판매 기타'
    },
    # "서비스"
    "4000": {
       '4221' : '놀이공원·테마파크',
       '4222' : '호텔·리조트·숙박',
       '4223' : '여행·캠프·레포츠',
       '4224' : '영화관·공연장',
       '4225' : '전시·컨벤션·세미나',
       '4070' : '안내데스크·리셉션',
       '4090' : '주차유도·안내',
       '4095' : '보안·경비·경호',
       '4100' : '주유·세차',
       '4228' : '렌터카·차량관리',
       '4120' : '전단지배포',
       '4130' : '청소·미화',
       '4135' : '렌탈관리·A/S',
       '4227' : '골프캐디',
       '4140' : '헤어·미용·네일샵',
       '4149' : '피부관리·마사지',
       '4160' : '반려동물케어',
       '4170' : '베이비시터·가사도우미',
       '4180' : '결혼·연회·장례도우미',
       '4200' : '이벤트·행사스텝',
       '4210' : '나레이터모델',
       '4220' : '피팅모델',
       '4226' : '공인중개',
       '4990' : '서비스 기타'
    },
    # "사무직"
    "6000": {
        '6010' : '사무보조',
        '6015' : '문서작성·자료조사',
        '6082' : '데이터수집·가공',
        '6020' : '비서',
        '6030' : '경리·회계보조',
        '6033' : '인사·총무',
        '6036' : '마케팅·광고·홍보',
        '6081' : '바이럴·SNS마케팅',
        '6050' : '번역·통역',
        '6055' : '복사·출력·제본',
        '6060' : '편집·교정·교열',
        '6070' : '공공기관·공기업·협회',
        '6080' : '학교·도서관·교육기관'
    },
    # "고객상담·리서치·영업"
    "7000": {
        '7010' : '고객상담·인바운드',
        '7020' : '텔레마케팅·아웃바운드',
        '7051' : '쇼핑몰인바운드',
        '7025' : '금융·보험영업',
        '7030' : '오프라인영업·판매',
        '7040' : '설문조사·리서치',
        '7052' : '콜센터관리·모니터링',
        '7050' : '영업관리·지원'
    },
    # "생산·건설·노무"
    "8000": {
        '8020' : '제조·가공·조립',
        '8040' : '포장·품질검사',
        '8050' : '입출고·창고관리',
        '8056' : '상하차·소화물 분류',
        '8111' : '물류피킹·포장·전산',
        '8112' : '지게차운전',
        '8113' : '금형·사출·프레스·사상',
        '8114' : '반도체·전자부품생산',
        '8115' : '기계조작·오퍼레이터',
        '8075' : '정비·수리·설치·A/S',
        '8116' : '전기·시설물관리',
        '8117' : '운반·설치·철거',
        '8085' : '공사·건설현장',
        '8095' : '전기·칸막이·배관공사',
        '8118' : '인테리어·보수공사',
        '8100' : '조선소',
        '8110' : '재단·재봉',
        '8990' : '생산·건설·노무 기타'
    },
    # "IT·기술"
    "9000": {
        '9005' : '웹·콘텐츠기획',
        '9010' : '사이트관리·기술지원',
        '9060' : '프로그래머',
        '9061' : 'HTML코딩',
        '9063' : 'QA·테스터·검증',
        '9066' : '시스템·네트워크·보안',
        '9070' : 'PC·디지털기기 설치·관리'
    },
    # "교육 강사"
    "A000": {
        'A010' : '입시·보습학원',
        'A020' : '외국어·어학원',
        'A091' : '독서·논술·스피치학원',
        'A030' : '컴퓨터·정보통신',
        'A033' : '요가·필라테스 강사',
        'A036' : '피트니스 트레이너',
        'A038' : '레져스포츠 강사',
        'A040' : '예체능 강사',
        'A050' : '유아·유치원',
        'A092' : '등하원·승하차도우미',
        'A060' : '방문·학습지',
        'A070' : '보조교사',
        'A080' : '자격증·기술학원',
        'A090' : '국비교육기관',
        'A093' : '학원운영지원',
        'A094' : '교재·교육콘텐츠제작',
        'A990' : '교육·강사 기타'
    },
    # "디자인"
    "B000": {
        'B010' : '웹·모바일디자인',
        'B020' : '그래픽·영상·편집디자인',
        'B030' : '제품·산업디자인',
        'B040' : 'CAD·CAM·인테리어디자인',
        'B050' : '캐릭터·애니메이션디자인',
        'B060' : '패션·잡화디자인',
        'B990' : '디자인 기타'
    },
    # "미디어"
    "C000": {
        'C010' : '보조출연·방청',
        'C020' : '방송스텝·촬영보조',
        'C030' : '동영상촬영·편집',
        'C035' : '사진촬영·편집',
        'C040' : '조명·음향',
        'C050' : '방송사·프로덕션',
        'C060' : '신문·잡지·출판',
        'C990' : '미디어 기타'
    },
    # "운전·배달"
    "D000": {
        'D010' : '화물·운송·이사',
        'D060' : '택배·배송기사',
        'D071' : '납품기사',
        'D050' : '중장비·특수차',
        'D072' : '발렛파킹',
        'D020' : '택시·대리·수행기사',
        'D030' : '버스·셔틀운전',
        'D073' : '퀵서비스',
        'D070' : '배달대행·음식배달',
        'D0674' : '도보배달'
    },
    # "병원·간호·연구"
    "E000": {
        'E010' : '간호조무사·간호사',
        'E071' : '의료기사',
        'E020' : '간병·요양보호사',
        'E030' : '원무·코디네이터',
        'E040' : '외래보조·병동보조',
        'E050' : '수의테크니션·동물보건사',
        'E060' : '실험·연구보조',
        'E070' : '생동성·임상시험'
    }
}




def sub_code_list() :                   # 전체 직종 코드
    sub_code = []

    for i in job_code.keys() :
        sub_code += job_code[i].keys()

    return sub_code


def sub_code_list_part(code) : # 직업분류 별 직종 코드
    result = list(job_code[code].keys())
    return result


def match_alba_name(sub_code) :         # 직종 이름
    alba_name = job_code[sub_code[0]+'000'][sub_code]

    return alba_name


def match_job_code(sub_code) :          # 직업분류
    job_code = sub_code[0] + '000'
    return job_code